Tekla Open API Reference for Tekla Structures 2025
LevelMark.LevelMarkAttributes.Unit Property
 Gets or sets the unit attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UnitAttributes Unit { get; set; }
Public Property Unit As UnitAttributes
	Get
	Set
Property Value
Type: UnitAttributes
See Also
Reference
LevelMark.LevelMarkAttributes Class
Tekla.Structures.Drawing Namespace